// https://github.com/iamwhcn
// 2021/5/24
#include "des.h"

// 初始置换IP
const uint8_t IP[] = {
    58, 50, 42, 34, 26, 18, 10, 2,
    60, 52, 44, 36, 28, 20, 12, 4,
    62, 54, 46, 38, 30, 22, 14, 6,
    64, 56, 48, 40, 32, 24, 16, 8,
    57, 49, 41, 33, 25, 17, 9, 1,
    59, 51, 43, 35, 27, 19, 11, 3,
    61, 53, 45, 37, 29, 21, 13, 5,
    63, 55, 47, 39, 31, 23, 15, 7};

// 逆初始置换IP^-1
const uint8_t PI[] = {
    40, 8, 48, 16, 56, 24, 64, 32,
    39, 7, 47, 15, 55, 23, 63, 31,
    38, 6, 46, 14, 54, 22, 62, 30,
    37, 5, 45, 13, 53, 21, 61, 29,
    36, 4, 44, 12, 52, 20, 60, 28,
    35, 3, 43, 11, 51, 19, 59, 27,
    34, 2, 42, 10, 50, 18, 58, 26,
    33, 1, 41, 9, 49, 17, 57, 25};

const uint8_t E[] = {
    32, 1, 2, 3, 4, 5,
    4, 5, 6, 7, 8, 9,
    8, 9, 10, 11, 12, 13,
    12, 13, 14, 15, 16, 17,
    16, 17, 18, 19, 20, 21,
    20, 21, 22, 23, 24, 25,
    24, 25, 26, 27, 28, 29,
    28, 29, 30, 31, 32, 1};

// P盒置换
const uint8_t P[] = {
    16, 7, 20, 21,
    29, 12, 28, 17,
    1, 15, 23, 26,
    5, 18, 31, 10,
    2, 8, 24, 14,
    32, 27, 3, 9,
    19, 13, 30, 6,
    22, 11, 4, 25};

// S盒
const uint8_t S[8][64] = {{// S1
                                  14, 4, 13, 1, 2, 15, 11, 8, 3, 10, 6, 12, 5, 9, 0, 7,
                                  0, 15, 7, 4, 14, 2, 13, 1, 10, 6, 12, 11, 9, 5, 3, 8,
                                  4, 1, 14, 8, 13, 6, 2, 11, 15, 12, 9, 7, 3, 10, 5, 0,
                                  15, 12, 8, 2, 4, 9, 1, 7, 5, 11, 3, 14, 10, 0, 6, 13},
                                 {// S2
                                  15, 1, 8, 14, 6, 11, 3, 4, 9, 7, 2, 13, 12, 0, 5, 10,
                                  3, 13, 4, 7, 15, 2, 8, 14, 12, 0, 1, 10, 6, 9, 11, 5,
                                  0, 14, 7, 11, 10, 4, 13, 1, 5, 8, 12, 6, 9, 3, 2, 15,
                                  13, 8, 10, 1, 3, 15, 4, 2, 11, 6, 7, 12, 0, 5, 14, 9},
                                 {// S3
                                  10, 0, 9, 14, 6, 3, 15, 5, 1, 13, 12, 7, 11, 4, 2, 8,
                                  13, 7, 0, 9, 3, 4, 6, 10, 2, 8, 5, 14, 12, 11, 15, 1,
                                  13, 6, 4, 9, 8, 15, 3, 0, 11, 1, 2, 12, 5, 10, 14, 7,
                                  1, 10, 13, 0, 6, 9, 8, 7, 4, 15, 14, 3, 11, 5, 2, 12},
                                 {// S4
                                  7, 13, 14, 3, 0, 6, 9, 10, 1, 2, 8, 5, 11, 12, 4, 15,
                                  13, 8, 11, 5, 6, 15, 0, 3, 4, 7, 2, 12, 1, 10, 14, 9,
                                  10, 6, 9, 0, 12, 11, 7, 13, 15, 1, 3, 14, 5, 2, 8, 4,
                                  3, 15, 0, 6, 10, 1, 13, 8, 9, 4, 5, 11, 12, 7, 2, 14},
                                 {// S5
                                  2, 12, 4, 1, 7, 10, 11, 6, 8, 5, 3, 15, 13, 0, 14, 9,
                                  14, 11, 2, 12, 4, 7, 13, 1, 5, 0, 15, 10, 3, 9, 8, 6,
                                  4, 2, 1, 11, 10, 13, 7, 8, 15, 9, 12, 5, 6, 3, 0, 14,
                                  11, 8, 12, 7, 1, 14, 2, 13, 6, 15, 0, 9, 10, 4, 5, 3},
                                 {// S6
                                  12, 1, 10, 15, 9, 2, 6, 8, 0, 13, 3, 4, 14, 7, 5, 11,
                                  10, 15, 4, 2, 7, 12, 9, 5, 6, 1, 13, 14, 0, 11, 3, 8,
                                  9, 14, 15, 5, 2, 8, 12, 3, 7, 0, 4, 10, 1, 13, 11, 6,
                                  4, 3, 2, 12, 9, 5, 15, 10, 11, 14, 1, 7, 6, 0, 8, 13},
                                 {// S7
                                  4, 11, 2, 14, 15, 0, 8, 13, 3, 12, 9, 7, 5, 10, 6, 1,
                                  13, 0, 11, 7, 4, 9, 1, 10, 14, 3, 5, 12, 2, 15, 8, 6,
                                  1, 4, 11, 13, 12, 3, 7, 14, 10, 15, 6, 8, 0, 5, 9, 2,
                                  6, 11, 13, 8, 1, 4, 10, 7, 9, 5, 0, 15, 14, 2, 3, 12},
                                 {// S8
                                  13, 2, 8, 4, 6, 15, 11, 1, 10, 9, 3, 14, 5, 0, 12, 7,
                                  1, 15, 13, 8, 10, 3, 7, 4, 12, 5, 6, 11, 0, 14, 9, 2,
                                  7, 11, 4, 1, 9, 12, 14, 2, 0, 6, 10, 13, 15, 3, 5, 8,
                                  2, 1, 14, 7, 4, 10, 8, 13, 15, 12, 9, 0, 3, 5, 6, 11}};

// 选择置换PC-1
const uint8_t PC1[] = {
    57, 49, 41, 33, 25, 17, 9,
    1, 58, 50, 42, 34, 26, 18,
    10, 2, 59, 51, 43, 35, 27,
    19, 11, 3, 60, 52, 44, 36,
    63, 55, 47, 39, 31, 23, 15,
    7, 62, 54, 46, 38, 30, 22,
    14, 6, 61, 53, 45, 37, 29,
    21, 13, 5, 28, 20, 12, 4};

// 选择置换PC-2
const uint8_t PC2[] = {
    14, 17, 11, 24, 1, 5,
    3, 28, 15, 6, 21, 10,
    23, 19, 12, 4, 26, 8,
    16, 7, 27, 20, 13, 2,
    41, 52, 31, 37, 47, 55,
    30, 40, 51, 45, 33, 48,
    44, 49, 39, 56, 34, 53,
    46, 42, 50, 36, 29, 32};

// 每一轮子密钥生成过程中循环左移的位数
const uint8_t LS[] = {
    1, 1, 2, 2, 2, 2, 2, 2, 1, 2, 2, 2, 2, 2, 2, 1};

/**子密钥生成(这里不进行奇偶校验)
 * @param key 种子密钥
 * @param 16个子密钥组成的数组
 */
void key_generation(const uint64_t key, uint64_t sub_keys[])
{
    // 选择置换PC-1 (56位)
    uint64_t pc1_res = 0;
    for (int i = 0; i < 56; i++)
    {
        pc1_res <<= 1;
        pc1_res |= (key >> (64 - PC1[i])) & LB64_MASK;
    }
    // 拆分成两个28位
    uint32_t C = (uint32_t)((pc1_res >> 28) & 0x000000000fffffff);
    uint32_t D = (uint32_t)(pc1_res & 0x000000000fffffff);
    // 循环生成16个子密钥
    for (int i = 0; i < 16; i++)
    {
        // 循环左移位
        for (int j = 0; j < LS[i]; j++)
        {
            C = 0x0fffffff & (C << 1) | 0x00000001 & (C >> 27);
            D = 0x0fffffff & (D << 1) | 0x00000001 & (D >> 27);
        }
        // 选择置换PC-2 (48位)
        uint64_t temp = (((uint64_t)C) << 28) | (uint64_t)D;
        for (int j = 0; j < 48; j++)
        {
            sub_keys[i] <<= 1;
            sub_keys[i] |= (temp >> (56 - PC2[j])) & LB64_MASK;
        }
    }
}

/** 初始置换IP
 * @param input 置换前的数据块
 * @return 置换后的数据块
 */
inline uint64_t initial_permutation(const uint64_t input)
{
    uint64_t res = 0;
    for (int i = 0; i < 64; i++)
    {
        res <<= 1;
        res |= (input >> (64 - IP[i])) & LB64_MASK;
    }
    return res;
}

/**逆初始置换IP^-1
 * @param input 置换前的数据块
 * @return 置换后的数据块
 */
inline uint64_t final_permutation(const uint64_t input)
{
    uint64_t res = 0;
    for (int i = 0; i < 64; i++)
    {
        res <<= 1;
        res |= (input >> (64 - PI[i])) & LB64_MASK;
    }
    return res;
}

/**f函数
 * @param R 数据块右半部分
 * @param K 子密钥
 * @return f函数结果
 */
inline uint32_t f_function(const uint32_t R, const uint64_t K)
{
    // E盒扩展32bit->48bit
    uint64_t expansion_res = 0;
    for (int i = 0; i < 48; i++)
    {
        expansion_res <<= 1;
        expansion_res |= (uint64_t)((R >> (32 - E[i])) & LB32_MASK);
    }
    // 与密钥进行异或运算
    expansion_res ^= K;
    // S盒变换
    uint32_t substitution_res = 0;
    for (int j = 0; j < 8; j++)
    {
        uint8_t row = (uint8_t)((expansion_res & (0x0000840000000000 >> 6 * j)) >> (42 - 6 * j));
        row = (row >> 4) | row & 0x01;
        uint8_t column = (uint8_t)((expansion_res & (0x0000780000000000 >> 6 * j)) >> (43 - 6 * j));
        substitution_res <<= 4;
        substitution_res |= (uint32_t)(S[j][16 * row + column] & 0x0f);
    }
    // P盒置换
    uint32_t f_function_res = 0;
    for (int i = 0; i < 32; i++)
    {
        f_function_res <<= 1;
        f_function_res |= (substitution_res >> (32 - P[i])) & LB32_MASK;
    }
    return f_function_res;
}

/**DES加密算法
 * @param input 64bit明文信息
 * @param key 64bit密钥
 * @param mode 选择加密/解密
 * @return 64bit密文信息
 */
uint64_t des(const uint64_t input, const uint64_t key, const mode_t mode)
{
    // 生成子密钥
    uint64_t sub_keys[16];
    key_generation(key, sub_keys);
    // 初始置换IP
    uint64_t init_perm_res = initial_permutation(input);
    uint32_t L = (uint32_t)(init_perm_res >> 32) & L64_MASK;
    uint32_t R = (uint32_t)init_perm_res & L64_MASK;
    // 16轮圈变换
    for (int i = 0; i < 16; i++)
    {
        uint64_t K;
        if (mode == e) // 加密
            K = sub_keys[i];
        else // 解密
            K = sub_keys[15 - i];
        // f函数
        uint32_t f_function_res = f_function(R, K);
        uint32_t temp = L ^ f_function_res;
        // 交换L和R
        L = R;
        R = temp;
    }
    // 合并R和L
    uint64_t temp = (((uint64_t)R) << 32) | (uint64_t)L;
    // 逆初始置换IP^-1
    return final_permutation(temp);
}